

Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт
	
	Если НеобходимВызовСервера(ТекущаяСтрока, СтруктураДействий) Тогда
		ТекущаяСтрокаСтруктура = ПолучитьТекущуюСтрокуСтруктурой(ТекущаяСтрока,СтруктураДействий);
		ВЦК_ВызовСервера.ОбработатьСтрокуТЧ(ТекущаяСтрокаСтруктура, СтруктураДействий);		
	    ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ТекущаяСтрокаСтруктура);
		Возврат;
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьЦенуПоСуммеВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры

Функция ПолучитьТекущуюСтрокуСтруктурой(ТекущаяСтрока, СтруктураДействий)
	
	СтруктураПолейТЧ = Новый Структура;
	
	СтруктураПолейТЧ.Вставить("Сумма");
	СтруктураПолейТЧ.Вставить("Цена", 0);
	
	Если СтруктураДействий.Свойство("ПересчитатьСумму") или СтруктураДействий.Свойство("ПересчитатьЦенуПоСумме") Тогда
		СтруктураПолейТЧ.Вставить("Количество", 0);
		СтруктураПолейТЧ.Вставить("Цена", 0);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураПолейТЧ, ТекущаяСтрока);
	
	Возврат СтруктураПолейТЧ;
	
КонецФункции // ()

Функция НеобходимВызовСервера(ТекущаяСтрока, СтруктураДействий)
	
	Если ТекущаяСтрока.Свойство("Автомобиль")  Тогда
		Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажи") И ЗначениеЗаполнено(ТекущаяСтрока.Автомобиль) Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ТекущаяСтрока.Свойство("Работа")  Тогда
		Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажи") И ЗначениеЗаполнено(ТекущаяСтрока.Работа) Тогда
			Возврат Истина;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтрока.Свойство("Номенклатура") Тогда
		Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажи") И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // НеобходимВызовСервера()
