//++ ВЦК Андрей	13.06.2022 
// тест Кофы
//-- ВЦК Андрей	13.06.2022
Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт
	
	//ЗаполнитьЦенуПродажиВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);
	
	//ЗаполнитьСтавкуНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);
	
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьЦенуПоСуммеВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);
	
	ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий);
	
	
КонецПроцедуры


