
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	                    
	СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", Новый Структура("Дата, ТипЦен, ЦенаВключаетНДС", Объект.Дата, Объект.ТипЦен, Истина)); //СуммаВключаетНДС переопределим на сервере если типЦен- стоит флаг = Ложь = ценаВключает НДС
	//СтруктураДействий.Вставить("ДанныеОбъекта", Новый Структура("Организация, ПодразделениеКомпании, Флаг_ОсвобожденОтНДС, Контрагент", Объект.Организация, Объект.ПодразделениеКомпании, Ложь,Объект.Контрагент));
	//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВСтрокеТЧ");
	//СтруктураДействий.Вставить("ЗаполнитьАкцииПоРемонту");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	//СтруктураДействий.Вставить("Пересчитать_СуммуСкидки");
	//СтруктураДействий.Вставить("Пересчитать_СуммуВСЕГО");
	//СтруктураДействий.Вставить("ПересчитатьНДС"); 			// НДС то по Какой сумме считается ????? по сумме или по СуммаВсего????
	//СтруктураДействий.Вставить("КоличествоКСписанию"); 		// КоличествоКСписанию - для бонусов добавить
												  
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуПоСумме");  // !!! ТОЛЬКО если будет куча суммовыхСтрочных Скидок(да плюс процентом) как цену пересчитывать ???
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий);
	
	
КонецПроцедуры
